{
    "en-header1": "Publication & Major Projects",
    "ko-header1": "논문 및 메이저 프로젝트",
    "en-header2": "Minor Projects",
    "ko-header2": "마이너 프로젝트",
    "en-header3": "Toy Projects",
    "ko-header3": "토이 프로젝트",
    "en-summary1": "These are projects that are either research papers, have required a significant amount of time, or are considered most important.",
    "ko-summary1": "논문이나 오랜 시간을 투자했거나 가장 중요하다고 생각하는 프로젝트입니다.",
    "en-summary2": "Included here are projects involving active participation in hackathons, or those that took more than a month to complete.",
    "ko-summary2": "참가했던 해커톤에서의 활약, 혹은 한 달 이상의 시간이 소요되었던 경우 여기 포함했습니다.",
    "en-summary3": "Included here are simple projects that took less than a month to complete or were done purely for learning purposes.",
    "ko-summary3": "한 달 이하로 걸렸거나, 제 개인 용도로 빠르게 만들었거나, 순수하게 공부하는 목적에서 했던 간단한 프로젝트를 여기 포함했습니다.", 
    "en-instruction": "You can open or close the details by clicking each box quickly. It's designed to ignore slow clicks, allowing you to drag the text for reading or copying.",
    "ko-instruction": "각 박스를 빠르게 클릭하면 세부 정보를 열거나 닫을 수 있습니다. 느린 클릭에는 반응하지 않도록 하여, 텍스트를 드래그하여 읽거나 복사하실 수 있도록 만들었습니다.",
    "publication-major-projects": [
      {
        "duration": "2023-11-01,2024-02-28",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "PyTorch", "icon": "icons/pytorch.svg" },
          { "name": "Jupyter", "icon": "icons/jupyter.svg" },
          { "name": "Pandas", "icon": "icons/pandas.svg" },
          { "name": "Numpy", "icon": "icons/numpy.svg" }
        ],
        "en-title": "Dilated SE-DenseNet for Radiographic Classification of Brain Tumors",
        "en-type": "Deep Learning & Medical Image Classification",
        "ko-type": "딥러닝 & 의료 이미지 분류",
        "en-organization": "University of Waterloo",
        "en-summary": [
          "Contributed as First Author",
          "Currently under Scientific Reports - Nature peer review progress",
          "Enhanced the DenseNet121 Convolutional DNN architecture for classifying brain tumor types by integrating dilation layers and SE (Squeeze-and-Excitation) modules, resulting in an improved F1-score from 0.834 to 0.967."
        ],
        "en-description": [
          "We have enhanced the DenseNet121 architecture to classify brain tumor types by integrating dilation layers and a Squeeze-and-Excitation (SE) module. This innovation aims to improve the model's capability to process and interpret complex radiographic data effectively.",
          "By adjusting the DenseNet121 framework, we successfully enhanced its sensitivity to contextual information in brain MRI images, which led to a more accurate classification of various tumor types (f1-score improved from 0.834 to 0.967). This advancement demonstrates the potential of modified neural networks in medical imaging and paves the way for more precise and early detection of brain tumors, potentially improving patient outcomes."
        ],
        "en-skills": [
          "Deep Learning",
          "Medical Image Classification",
          "Supervised Learning"
        ],
        "ko-title": "Dilated SE-DenseNet for Radiographic Classification of Brain Tumors",
        "ko-organization": "워털루 대학교",
        "ko-summary": [
          "제1 저자로 기여함",
          "현재 Scientific Reports - Nature Peer Review 진행 중",
          "확장 레이어와 SE (Squeeze-and-Excitation) 모듈을 통합하여 뇌종양 유형 분류를 위한 DenseNet121 Convolutional DNN 아키텍처를 개선하여 F1-score 0.834에서 0.967로 향상"
        ],
        "ko-description": [
          "확장 레이어와 Squeeze-and-Excitation (SE) 모듈을 통합하여 DenseNet121 아키텍처를 개선함으로써 뇌종양 유형을 분류할 수 있도록 했습니다. 이 혁신은 모델이 복잡한 방사선 데이터를 효과적으로 처리하고 해석할 수 있는 능력을 향상시키는 것을 목표로 합니다.",
          "DenseNet121 프레임워크를 조정함으로써 저희는 뇌 MRI 이미지의 맥락 정보에 대한 민감도를 성공적으로 향상시켜 다양한 종양 유형의 분류 정확도를 높였습니다 (F1-점수가 0.834에서 0.967로 개선됨). 이 발전은 의료 이미지 분류에 있어 수정된 신경망의 잠재력을 보여주며, 뇌종양의 더 정확하고 조기 발견을 가능하게 함으로써 환자의 결과를 개선할 수 있습니다."
        ],
        "ko-skills": [
          "딥 러닝",
          "의료 이미지 분류",
          "지도 학습"
        ]
      },
      {
        "duration": "2023-04-15,2023-10-30",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "Typescript", "icon": "icons/typescript.svg" },
          { "name": "Django", "icon": "icons/django.svg" },
          { "name": "React", "icon": "icons/react.svg" },
          { "name": "Auth0", "icon": "icons/auth0.svg" }
        ],
        "en-title": "Project Zone",
        "en-organization": "Project Zone Team",
        "en-type": "Backend Development",
        "ko-type": "백엔드",
        "en-summary": [
          "Found a project community platform that connects designers, developers, and enthusiasts.",
          "Developed Project Zone's backend REST API using Django and Auth0"
        ],
        "en-description": [
          "Young professionals and students often seek opportunities to develop their skills and build projects that can enhance their job market prospects. However, there has been a lack of a dedicated platform for entry-level professionals to connect with others for collaborative projects and learning. To address this gap, we created Project Zone, a platform designed to help users find collaborators and work on meaningful projects together.",
          "Unfortunately, we have decided to discontinue Project Zone. We halted the project at the beta stage, before proceeding with user acceptance testing, after concluding that it no longer holds a competitive edge in the market."
        ],
        "en-skills": [
          "Backend Development", "REST API"
        ],
        "ko-title": "Project Zone",
        "ko-organization": "Project Zone Team",
        "ko-summary": [
          "디자이너, 개발자 및 기술 애호가들을 연결해주는 프로젝트 커뮤니티 플랫폼인 Project Zone을 개발",
          "Django와 Auth0를 사용하여 백엔드 REST API 개발"
        ],
        "ko-description": [
          "취업 준비생들, 그리고 학생들은 종종 자신의 기술을 개발하고 취업 시장에서의 경쟁력을 높일 수 있는 프로젝트를 진행할 기회를 찾습니다. 그러나 오직 이런 특정 층의 협력 프로젝트를 위해 사람들을 찾고 배우기 위한 전용 플랫폼은 부족했습니다. 이러한 격차를 해소하기 위해, 저희는 사용자들이 협력자를 찾고 의미 있는 프로젝트를 함께 진행할 수 있도록 도와주는 플랫폼인 Project Zone을 만들었습니다.",
          "그러나 안타깝게도, 현재는 Project Zone의 개발을 중단하기로 결정했습니다. 시장에서의 경쟁력이 더 이상 없다고 판단하여 사용자 수용 테스트를 진행하기 전 베타 단계에서 프로젝트를 중단하게 되었습니다."
        ],
        "ko-skills": [
          "백엔드 개발", "REST API"
        ]
      },
      {
        "duration": "2024-08-01,2024-09-15",
        "techStacks": [
          { "name": "Typescript", "icon": "icons/typescript.svg" },
          { "name": "React", "icon": "icons/react.svg" },
          { "name": "AWS", "icon": "icons/amazonwebservices.svg" },
          { "name": "Amazon S3", "icon": "icons/amazons3.svg" },
          { "name": "Amazon Route 53", "icon": "icons/amazonroute53.svg" }
        ],
        "en-title": "Portfolio Website",
        "en-type": "Frontend Development",
        "ko-type": "프론트엔드",
        "en-organization": "Personal Use",
        "en-summary": [
          "This is the website you are currently viewing.",
          "I created this project to serve as my portfolio and to learn frontend development using React and TypeScript."
        ],
        "en-description": [
          "This website serves as both a personal portfolio and a learning project. It was developed using React and TypeScript to enhance my frontend development skills while showcasing my work."
        ],
        "en-skills": [
          "Frontend Development"
        ],
        "ko-title": "포트폴리오 웹사이트",
        "ko-organization": "개인 용도",
        "ko-summary": [
          "이것은 지금 보고 계신 웹사이트입니다.",
          "이 프로젝트는 포트폴리오 용도와 React와 TypeScript를 활용한 프론트엔드 개발을 공부하기 위해 만들었습니다."
        ],
        "ko-description": [
          "이 웹사이트는 개인 포트폴리오이자 학습 프로젝트로서, React와 TypeScript를 활용하여 프론트엔드 개발 역량을 향상하고 제 작업을 보여주기 위해 제작되었습니다."
        ],
        "ko-skills": [
          "프론트엔드 개발"
        ]
      }
    ],
    "minor-projects": [
      {
        "duration": "2024-01-26,2024-02-02",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "OpenAI", "icon": "icons/openai.svg" },
          { "name": "Dataiku", "icon": "icons/dataiku.svg" },
          { "name": "Jupyter", "icon": "icons/jupyter.svg" }
        ],
        "en-title": "Scotiabank Data Discovery Days 2024 AI-thon",
        "en-organization": "Scotiabank",
        "en-type": "AI/LLM, Prompt Engineering, Fine-Tuning",
        "ko-type": "AI/LLM, 프롬프트 엔지니어링, 파인튜닝",
        "en-summary": [
          "Manually labeled a small subset of data to create a base for fine-tuning BERT to detect and filter out irrelevant reviews (easter eggs) with 99.3% accuracy.",
          "Applied prompt engineering techniques, including Chain-of-Thought and Few-Shot learning, for multi-label classification on initially unlabeled app review data."
        ],
        "ko-summary": [
          "데이터의 소량을 수동으로 라벨링하여 BERT를 파인튜닝할 기반을 마련하였고, 이를 통해 99.3%의 정확도로 관련 없는 리뷰(이스터에그)를 감지 및 제거했습니다.",
          "Chain-of-Thought 및 Few-Shot 학습과 같은 프롬프트 엔지니어링 기법을 활용하여 처음에는 비레이블된 앱 리뷰 데이터의 다중 레이블 분류를 수행했습니다."
        ],
        "en-description": [
          "Participated in Scotiabank's AI-thon to analyze initially unlabeled app store review data using prompt engineering + OpenAI's GPT4.0. Started by manually labeling a small subset of data to serve as the foundation for training. Implemented prompt engineering methods, such as Chain-of-Thought reasoning and Few-Shot learning, for multi-label classification.",
          "Fine-tuned a BERT model to identify and remove irrelevant 'easter egg' reviews, achieving high accuracy of 99.3%. Conducted topic labeling using GPT-4 with the manually labeled dataset, and used evaluation metrics like RMSE, Jaccard distance, and accuracy to assess the model's performance. Performed time-series analysis on average ratings to identify key factors affecting customer satisfaction."
        ],
        "ko-description": [
          "Scotiabank의 AI-thon에 참여하여 처음에는 비레이블된 앱 스토어 리뷰 데이터를 프롬프트 엔지니어링 + OpenAI의 GPT4.0으로 분석했습니다. 먼저 데이터의 소량을 수동으로 라벨링하여 학습의 기반을 마련했습니다. Chain-of-Thought 추론과 Few-Shot 학습과 같은 프롬프트 엔지니어링 방법을 사용하여 다중 레이블 분류를 수행했습니다.",
          "BERT 모델을 파인튜닝하여 관련 없는 '이스터에그' 리뷰를 99.3%의 정확도로 감지 및 제거했습니다. 수동 라벨링한 데이터를 토대로 GPT-4를 사용하여 토픽 라벨링을 수행했으며, RMSE, Jaccard 거리, 정확도와 같은 평가 지표를 활용하여 모델 성능을 평가했습니다. 시계열 분석을 통해 고객 만족도에 영향을 미치는 주요 요소를 파악했습니다."
        ],
        "en-skills": [
          "AI/LLMs",
          "Fine-tuning",
          "Prompt Engineering",
          "Natural Language Processing (NLP)",
          "Sentiment Analysis",
          "Data Science",
          "Data Engineering"
        ],
        "ko-title": "Scotiabank Data Discovery Days 2024 AI-thon",
        "ko-organization": "Scotiabank",
        "ko-skills": [
          "AI/LLMs",
          "파인튜닝",
          "프롬프트 엔지니어링",
          "자연어 처리",
          "정서 분석",
          "데이터 사이언스",
          "데이터 엔지니어링"
        ]
      },
      {
        "duration": "2022-04-28,2022-05-01",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "PyTorch", "icon": "icons/pytorch.svg" },
          { "name": "Jupyter", "icon": "icons/jupyter.svg" },
          { "name": "Google Slides", "icon": "icons/googleslides.svg" }
        ],
        "en-title": "ASA DataFest 2022",
        "en-organization": "UW & ASA",
        "en-type": "Unsupervised Learning, UMAP Clustering",
        "ko-type": "비지도학습, UMAP 클러스터링",
        "en-summary": [
          "Conducted time-based analysis on user behavior in the game \"playForward: Elm City\" to understand its impact on real-life actions.",
          "Employed clustering techniques to identify behavioral changes over 4-5 weeks, using aggregated session log data to track student progress and strategies."
        ],
        "en-description": [
          "Analyzed session log data of \"playForward: Elm City\" to predict and understand student behaviors and determine the game's influence on real-life actions. Aggregated data to calculate the number of weeks since each player's first interaction.",
          "Utilized clustering and dimensionality reduction (UMAP) techniques to identify patterns and behavioral changes. Found two distinct groups: those who changed behavior through gameplay and those who did not, providing insights for potential game interventions."
        ],
        "en-skills": [
          "Data Analysis",
          "Unsupervised Learning",
          "Dimensionality Reduction (UMAP)",
          "Data Visualization"
        ],
        "ko-title": "ASA DataFest 2022",
        "ko-organization": "ASA",
        "ko-summary": [
          "게임 \"playForward: Elm City\"에서 사용자의 행동 변화를 분석하여 실제 생활에 미치는 영향을 파악하였습니다.",
          "학생들의 진행 상황과 전략을 추적하기 위해 세션 로그 데이터를 집계하고 클러스터링 기법을 사용하여 4-5주 간의 행동 변화를 파악하였습니다."
        ],
        "ko-description": [
          "\"playForward: Elm City\"의 세션 로그 데이터를 분석하여 학생들의 행동을 예측하고 게임이 실제 행동에 미치는 영향을 파악했습니다. 각 플레이어의 첫 상호작용 이후 몇 주가 지났는지 계산하기 위해 데이터를 집계했습니다.",
          "클러스터링 및 차원 축소(UMAP) 기법을 사용하여 패턴과 행동 변화를 식별했습니다. 게임 플레이를 통해 행동을 변화시킨 그룹과 그렇지 않은 그룹을 발견하여 게임 개입의 가능성을 제시했습니다."
        ],
        "ko-skills": [
          "데이터 분석",
          "비지도학습",
          "차원 축소 (UMAP)",
          "데이터 시각화"
        ]
      },
      {
        "duration": "2019-07-12,2019-08-14",
        "techStacks": [
          { "name": "HTML", "icon": "icons/html5.svg" },
          { "name": "CSS", "icon": "icons/css3.svg" },
          { "name": "Bootstrap", "icon": "icons/bootstrap.svg" },
          { "name": "Javascript", "icon": "icons/javascript.svg" },
          { "name": "jQuery", "icon": "icons/jquery.svg" },
          { "name": "PHP", "icon": "icons/php.svg" },
          { "name": "D3.js", "icon": "icons/d3dotjs.svg" }
        ],
        "en-title": "Portfolio Website (Old Version)",
        "en-organization": "Personal Use",
        "en-type": "Full-Stack Development",
        "ko-type": "풀스택",
        "en-summary": [
          "Built a responsive portfolio website using vanilla JavaScript, jQuery, and Bootstrap."
        ],
        "ko-summary": [
          "Vanilla JavaScript, jQuery, 그리고 Bootstrap을 사용하여 반응형 포트폴리오 웹사이트를 개발하였습니다."
        ],
        "en-description": [
          "Developed an old version of my personal portfolio website using HTML, CSS, JavaScript, and jQuery to ensure responsiveness across different devices. Incorporated Bootstrap for layout and styling, and utilized D3.js for data visualizations. The website was hosted on Hostinger until June 2023. Currently, the website is not being hosted."
        ],
        "ko-description": [
          "HTML, CSS, JavaScript, jQuery를 사용하여 반응형 포트폴리오 웹사이트의 구버전을 개발하였습니다. 레이아웃과 스타일링을 위해 Bootstrap을 사용하였고, D3.js를 활용하여 데이터 시각화를 구현하였습니다. 이 웹사이트는 2019년부터 2021년까지 Hostinger에서 호스팅되었으며, 현재는 호스팅 중단 상태입니다."
        ],
        "en-skills": [
          "Responsive Web Design",
          "Front-End Development"
        ],
        "ko-title": "포트폴리오 웹사이트 (구버전)",
        "ko-organization": "개인 용도",
        "ko-skills": [
          "반응형 웹 디자인",
          "프론트엔드 개발"
        ]
      },
      {
        "duration": "2019-03-30,2019-04-10",
        "techStacks": [
          { "name": "C++", "icon": "icons/cplusplus.svg" }
        ],
        "en-title": "CS246 Chess Project",
        "en-type": "Object-Oriented Programming",
        "ko-type": "객체지향 프로그래밍",
        "en-organization": "University of Waterloo",
        "en-summary": [
          "Developed a fully functional chess game as the final project for the CS246 - Object-Oriented Software Development course.",
          "Implemented all chess functionalities, including Player vs Player, Player vs Computer, and Computer vs Computer modes, with four levels of AI difficulty."
        ],
        "ko-summary": [
          "CS246 - 객체지향 소프트웨어 개발 수업의 마지막 프로젝트로 체스 게임을 완성하였고, 만점을 받았습니다.",
          "기본적인 체스 기능과 더불어 4단계의 컴퓨터 AI 난이도를 포함하여 플레이어 대 플레이어, 플레이어 대 컴퓨터, 컴퓨터 대 컴퓨터 모드를 모두 구현하였습니다."
        ],
        "en-description": [
          "Our team developed this chess game for the final group assignment in CS246. The project involved implementing all standard chess functionalities, including different play modes (Player vs Player, Player vs Computer, and Computer vs Computer) and computer AI with four difficulty levels.",
          "Additionally, we implemented a graphical interface using X11, a setup mode for custom board configurations, move history, and a command interpreter. We followed the Observer design pattern to enhance the game's object-oriented structure. Our comprehensive implementation met all the project requirements and included bonus features like graphics, earning us a perfect score."
        ],
        "ko-description": [
          "CS246 - 객체지향 프로그래밍 과목의 마지막 그룹 과제로 이 체스 게임을 개발했습니다. 이 프로젝트는 플레이어 대 플레이어, 플레이어 대 컴퓨터, 컴퓨터 대 컴퓨터 등의 다양한 플레이 모드와 4단계의 컴퓨터 AI 난이도를 포함하여 모든 표준 체스 기능을 구현하는 것이었습니다.",
          "추가로, X11을 사용한 그래픽 인터페이스, 사용자 정의 보드 구성을 위한 설정 모드, 이동 기록 및 명령 인터프리터를 구현했습니다. 게임의 객체지향 구조를 향상시키기 위해 Observer 디자인 패턴을 적용했습니다. 이 프로젝트는 모든 요구 사항을 충족하고 그래픽과 같은 보너스 기능을 포함하여 만점을 받았습니다."
        ],
        "en-skills": [
          "C++",
          "Object-Oriented Programming",
          "Design Patterns (Observer)"
        ],
        "ko-title": "CS246 체스 프로젝트",
        "ko-organization": "워털루 대학교",
        "ko-skills": [
          "C++",
          "객체지향 프로그래밍",
          "디자인 패턴 (Observer)"
        ]
      }      
    ],
    "toy-projects": [
      {
        "duration": "2024-08",
        "en-title": "Grocery Split",
        "ko-title": "Grocery Split",
        "en-info": "A tool to split grocery costs based on item quantity, discounts, and taxes for group shopping at Costco: https://grocerysplit.edwardjwkim.com/",
        "ko-info": "친구들이랑 코스트코에서 단체 쇼핑 시 품목별 수량, 할인 및 세금을 나누기 위해 만든 도구입니다: https://grocerysplit.edwardjwkim.com/",
        "techStacks": [
          { "name": "Typescript", "icon": "icons/typescript.svg" },
          { "name": "React", "icon": "icons/react.svg" },
          { "name": "AWS", "icon": "icons/amazonwebservices.svg" },
          { "name": "Amazon S3", "icon": "icons/amazons3.svg" },
          { "name": "Amazon Route 53", "icon": "icons/amazonroute53.svg" }
        ]
      },
      {
        "duration": "2024-08",
        "en-title": "Cover Letter Prompt Generator",
        "ko-title": "Cover Letter Prompt Generator",
        "en-info": "A Streamlit tool that generates prompts for LLMs to create cover letters based on user input: https://cover-letter-prompt-generator.streamlit.app/",
        "ko-info": "유저가 입력한 정보로 LLM에 넣을 프롬프트를 자동 생성하는 Streamlit 기반 도구입니다: https://cover-letter-prompt-generator.streamlit.app/",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "Streamlit", "icon": "icons/streamlit.svg" }
        ]
      },
      {
        "duration": "2021-08",
        "en-title": "Keyword-Analysis-using-Twitter-API",
        "ko-title": "Twitter API를 이용한 키워드 분석",
        "en-info": "Collected Twitter data, extracted keywords, analyzed using association rules, and visualized the keyword network.",
        "ko-info": "Twitter 데이터를 수집하고 키워드를 추출하여 연관 분석 및 키워드 네트워크를 시각화하였습니다.",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "Pandas", "icon": "icons/pandas.svg" }
        ]
      },
      {
        "duration": "2021-08",
        "en-title": "Lottery-Number-Analysis",
        "ko-title": "로또번호 분석",
        "en-info": "A simple project to explore meaningful patterns in Korean lottery numbers, but lacked sufficient data (or perhaps, there were no patterns at all).",
        "ko-info": "한국 로또번호의 의미 있는 패턴을 찾기 위해 시도했지만 데이터가 부족했습니다 (어쩌면 패턴 자체가 없는게 사실 맞습니다).",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "Pandas", "icon": "icons/pandas.svg" }
        ]
      },
      {
        "duration": "2021-07",
        "en-title": "Text-Mining-with-ChromeDriver",
        "ko-title": "크롬드라이버를 이용한 텍스트 마이닝",
        "en-info": "Crawled NamuWiki data, extracted recent changes, and visualized keywords using a word cloud.",
        "ko-info": "나무위키의 데이터를 크롤링하여 최근 변화를 분석하고 키워드를 워드클라우드로 시각화하였습니다.",
        "techStacks": [
          { "name": "Python", "icon": "icons/python.svg" },
          { "name": "Selenium", "icon": "icons/selenium.svg" }
        ]
      },
      {
        "duration": "2018-06",
        "en-title": "Sudoku Solver",
        "ko-title": "스토쿠 해결사",
        "en-info": "A web-based Sudoku solver using a backtracking algorithm in C and Node.js for the frontend.",
        "ko-info": "백트래킹 알고리즘을 사용하여 C로 구현하고 Node.js로 웹 기반 인터페이스를 만든 스도쿠 해결 프로그램입니다.",
        "techStacks": [
          { "name": "C", "icon": "icons/c.svg" },
          { "name": "Node.js", "icon": "icons/nodedotjs.svg" }
        ]
      }      
    ]
  }