{
    "en-header": "Other Experiences",
    "ko-header": "기타 경력",
    "en-summary": "",
    "ko-summary": "",
    "en-instruction": "You can open or close the details by clicking each box quickly. It’s designed to ignore slow clicks, allowing you to drag the text for reading or copying.",
    "ko-instruction": "각 박스를 빠르게 클릭하면 세부 정보를 열거나 닫을 수 있습니다. 느린 클릭에는 반응하지 않도록 하여, 텍스트를 드래그하여 읽거나 복사하실 수 있도록 만들었습니다.",
    "other-experiences": [
      {
        "duration": "2020-01-28,2021-08-07",
        "en-company": "Ministry of National Defense, Republic of Korea",
        "en-role": "Sergeant",
        "en-type": "Full-Time (Mandatory Service)",
        "en-location": "Busan, South Korea",
        "en-summary": [
            "Independently managed daily transactions and prepared monthly financial settlements as an Administrative Soldier",
            "Led a squadron and oversaw barracks operations smoothly for 14 months as a squad leader (June 2020 - July 2021)",
            "Reduced time spent on repetitive tasks by 75% by generating reports using Excel and creating concise Word templates",
            "Produced ledgers and income statements by gathering supporting documents, finalizing reports, and maintaining financial records"
        ],
        "en-description": [
            "The Korea Armed Forces Welfare Agency is a unit directly under the Ministry of National Defense, overseeing various welfare facilities within the military, such as golf courses, hotels, and marts.",
            "As an administrative soldier in the Busan Support Headquarters of the Armed Forces Welfare Agency, I was responsible for financial tasks related to the management of personnel in marts and PXs in the Gyeongbuk and Gyeongnam regions. Additionally, I conducted all administrative tasks, including end-of-month financial settlements, within the unit under the supervision of the administrative support officer.",
            "Moreover, I served as a squad leader for 1 year and 2 months, managing personnel and the unit, and successfully maintained the unit without any incidents during my tenure."
        ],
        "en-skills": [
            "MS Excel",
            "MS Word",
            "Leadership",
            "Time Management",
            "Human Resources",
            "Bookkeeping",
            "Logistics Management"
        ],
        "ko-company": "국군복지단",
        "ko-role": "육군 병장",
        "ko-type": "만기 전역",
        "ko-location": "대한민국 부산",
        "ko-summary": [
            "행정병으로서 일일 거래를 관리하고 월말 재정 결산을 담당했습니다",
            "분대장으로서 14개월 동안 분대 및 막사 운영을 원활하게 관리했습니다 (2020년 6월 - 2021년 7월)",
            "Excel을 사용하여 보고서 양식을 생성하고 간결한 Word 템플릿을 제안하여 반복 작업에 소요되는 시간을 75% 절감했습니다",
            "지원 서류를 수집, 재정 기록을 유지하며, 원장과 월말자금결산을 작성했습니다"
          ],
        "ko-description": [
            "국군복지단은 국방부 직할 부대로서 군 내 골프장, 호텔, 마트 등 다양한 복지시설을 관할하는 부대입니다.",
            "저는 국군복지단 부산지원본부 소속 행정병으로서 경북 및 경남 지역의 마트와 부대 내 PX 관리 인원들의 자금 관련 업무를 담당하였으며, 부대 내 월말 자금 결산 및 기타 모든 행정 업무를 행정지원관 아래에서 진행 및 보조하였습니다.",
            "또한, 1년 2개월간 분대장으로서 인원 및 부대 관리를 담당하였고, 제가 분대장으로 있는 동안 부대를 무사고로 관리하고 잘 마무리했습니다."
          ],
        "ko-skills": [
            "MS Excel",
            "MS Word",
            "리더십",
            "시간 관리",
            "인사행정",
            "자금결산",
            "물류 관리"
        ]
      },
      {
        "duration": "2019-12-09,2020-01-27",
        "en-company": "ASAP Academy",
        "en-role": "IB / SAT Mathematics Instructor",
        "en-type": "Part-time",
        "en-location": "Seoul, South Korea",
        "en-summary": [
          "Instructed International Baccalaureate Higher Level (IB HL) Mathematics I & II, and SAT Mathematics",
          "Advised students on exam preparation strategies and university admission pathways"
        ],
        "en-description": [
          "I instructed IB HL Mathematics I & II and SAT Mathematics, providing students with comprehensive mathematical education and preparation. By analyzing each student's weaknesses based on their performance, I optimized my teaching methods to address individual needs effectively.",
          "Additionally, I provided personalized feedback and advised students on effective exam preparation strategies, guiding them through the university admission process and helping them navigate their academic and career pathways."
        ],
        "en-skills": [
          "Teaching",
          "Consulting",
          "IB/SAT Mathematics"
        ],
        "ko-company": "프리미엄 맞춤수업 학원",
        "ko-role": "IB/SAT 수학 강사",
        "ko-type": "시간제",
        "ko-location": "대한민국 서울",
        "ko-summary": [
          "International Baccalaureate Higher Level (IB HL) 수학 I & II 및 SAT 수학 지도",
          "학생들에게 시험 준비 전략과 대학 입학 경로에 대해 조언"
        ],
        "ko-description": [
          "IB HL 수학 I & II 및 SAT 수학을 가르치며 학생들에게 포괄적인 수학 교육과 준비를 제공하였습니다. 각 학생의 성과를 바탕으로 약점을 분석하여, 개별적인 요구에 효과적으로 대응하기 위해 제 교육 방식을 최적화하였습니다.",
          "또한, 개인 맞춤형 피드백을 제공하고 학생들에게 효과적인 시험 준비 전략을 조언하며, 대학 입학 과정을 안내하여 학업 및 진로를 계획하는 데 도움을 주었습니다."
          ],
        "ko-skills": [
          "학생 지도",
          "대입 컨설팅",
          "IB/SAT 수학"
        ]
      },
      {
        "duration": "2018-05-07,2018-08-24",
        "en-company": "Sheridan College",
        "en-role": "Computer Mathematics Learning Assistant",
        "en-type": "Internship",
        "en-location": "Oakville, Canada",
        "en-summary": [
          "Conducted 40% of the tutorials and managed all computer mathematics drop-in sessions at the Trafalgar campus",
          "Devised a streamlined method for self-serve data entry at the learning centre, significantly reducing the need for administrative corrections",
          "Created problem packets on calculus and computer fundamentals for course materials, enhancing student learning"
        ],
        "en-description": [
          "At Sheridan's Trafalgar campus, I conducted 40% of the tutorials and managed all computer mathematics drop-in sessions. My responsibilities included providing comprehensive support to students in understanding complex mathematical concepts and ensuring they received the help they needed outside of regular class hours. Additionally, I devised a streamlined method for self-serve data entry at the learning center, significantly reducing the need for administrative corrections.",
          "I created problem packets on calculus and computer fundamentals for course materials, which were highly praised by the professor and incorporated into the curriculum to aid student exam preparation. My efforts were well-received by students, earning an average rating of 4.8 out of 5 from over 80 feedbacks, reflecting the positive impact of my tutorials and support sessions on their learning experience."
        ],
        "en-skills": [
          "Teaching", 
          "Calculus", 
          "Computer Mathematics"
        ],
        "ko-company": "쉐리든 대학교", 
        "ko-role": "컴퓨터수학 조교",
        "ko-type": "인턴쉽",
        "ko-location": "캐나다 옥빌",
        "ko-summary": [
          "쉐리던 대학교 Trafalgar 캠퍼스에서 전체 수학 과목 튜토리얼의 40%를 진행하고 모든 컴퓨터 수학 드롭인 세션을 관리함",
          "학습 센터에서 학생들의 셀프 서비스 데이터 입력을 위한 간소화된 방법을 고안",
          "학생 학습 향상을 위해 미적분학 및 컴퓨터수학 기초에 대한 문제집 제작"
        ],
        "ko-description": [
          "쉐리던의 트라팔가 캠퍼스에서 저는 튜토리얼의 40%를 진행하고 모든 컴퓨터 수학 드롭인 세션을 관리했습니다. 제 책임은 학생들이 복잡한 수학 개념을 이해하고 정규 수업 시간 외에도 필요한 도움을 받을 수 있도록 종합적인 지원을 제공하는 것이었습니다. 추가적으로, 학습 센터에서 셀프 서비스 데이터 입력을 위한 간소화된 방법을 고안하여 행정 수정의 필요성을 크게 줄였습니다.",
          "저는 학생들의 시험 준비를 돕기 위해 미적분학 및 컴퓨터 기초에 대한 문제 패킷을 작성했으며, 이 패킷들은 교수님으로부터 높은 평가를 받아 커리큘럼에 포함되었습니다. 제 노력은 학생들로부터도 좋은 평가를 받아, 80건 이상의 피드백에서 평균 4.8점(5점 만점)을 받으며, 튜토리얼과 지원 세션이 학생들의 학습 경험에 긍정적인 영향을 미쳤습니다."
          ],
        "ko-skills": [
          "학생 지도", 
          "미적분", 
          "컴퓨터수학"
        ]
      },
      {
        "duration": "2019-12-01,2020-01-27",
        "en-company": "Top Star Entertainment",
        "en-role": "Background Actor, AD Assistant",
        "en-type": "Contract",
        "en-location": "Seoul, South Korea",
        "en-summary": [
          "Dramas featured in: Dr. Romantic, Crash Landing on You, Welcome",
          "[External] Audience: Seafood User Guide, Immortal Songs"
        ],
        "en-description": [
          "Student @ Dr. Romantic 2 Ep 3 Epilogue",
          "Reporter & office worker @ Crash Landing on You Ep 12",
          "AD Assistant @ Welcome",
          "Audience @ Seafood User Guide [External]",
          "Audience @ Immortal Songs [External]"
        ],
        "en-skills": [
          "Acting"
        ],
        "ko-company": "탑스타엔터테인먼트", 
        "ko-role": "엑스트라, AD보조",
        "ko-type": "계약직",
        "ko-location": "대한민국 서울",
        "ko-summary": [
          "작품: 낭만닥터2, 사랑의 불시착, 어서와",
          "월드기획 방청객 출연: 수산물 사용설명서, 불후의 명곡"
        ],
        "ko-description": [
          "낭만닥터2) 강의실 및 도서관 학생 역을 맡았습니다: 3화 에필로그",
          "사랑의 불시착) 기자 및 직장인 역을 맡았습니다: 12화",
          "어서와) AD보조",
          "수산물 사용설명서) 방청객 [월드기획]",
          "불후의 명곡) 방청객 [월드기획]"
          ],
        "ko-skills": [
          "엑스트라 연기"
        ]
      }
    ],
    "en-header2": "Part-time Experiences",
    "ko-header2": "알바 경력",
    "en-summary2": "",
    "ko-summary2": "",
    "part-time-experiences": [
      {
        "duration": "2023-09",
        "ko-info": "울산문수야구장 롯데자이언트 진행요원, 1루 엠뷸런스 담당",
        "en-info": "Baseball Stadium Staff"
      },
      {
        "duration": "2021-08",
        "ko-info": "한국동서발전 채용필기시험 시험운영위원",
        "en-info": "Test Proctor"
      },
      {
        "duration": "2021-08",
        "ko-info": "울산사랑 환경 콘서트 무대입구 보안요원",
        "en-info": "Concert Security Guard"
      },
      {
        "duration": "2019-09",
        "ko-info": "울산태화강둔치 콘서트 진행요원, 출연PD 보조, MR 전달 및 무대관리",
        "en-info": "Concert Staff - PD Assistant"
      },
      {
        "duration": "2019-09",
        "ko-info": "포토샾 보조 & 설치",
        "en-info": "Photoshop Assistant"
      },
      {
        "duration": "2019-09",
        "ko-info": "KCC 모델하우스 카페테리아",
        "en-info": "Cafeteria"
      },
      {
        "duration": "2019-09",
        "ko-info": "주차안내",
        "en-info": "Parking Attendant"
      },
      {
        "duration": "2019-09",
        "ko-info": "울산 전국 우수시장박람회 진행요원 (통역 및 인포메이션)",
        "en-info": "Information & Interpreter"
      },
      {
        "duration": "2019-09",
        "ko-info": "페스티발 진행 스텝",
        "en-info": "Festival Staff"
      },
      {
        "duration": "2019-09",
        "ko-info": "신바람에너지놀이터 지역통합축제 멘토",
        "en-info": "Community Festival Mentor"
      },
      {
        "duration": "2019-09",
        "ko-info": "인형탈",
        "en-info": "Mascot Performer"
      },
      {
        "duration": "2019-09",
        "ko-info": "소형화물단순 하차",
        "en-info": "Logistics laborer"
      }
    ]
  }